ardave/MSP430FR5969/msp430fr5969.svd
        <register>
          <name>RTCADOW</name>
          <description>Real Time Clock Alarm Day of week</description>
          <addressOffset>26</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>DOW0</name>
              <description>Real Time Clock DOW Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOW1</name>
              <description>Real Time Clock DOW Bit: 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOW2</name>
              <description>Real Time Clock DOW Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOW3</name>
              <description>Real Time Clock DOW Bit: 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOW4</name>
              <description>Real Time Clock DOW Bit: 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOW5</name>
              <description>Real Time Clock DOW Bit: 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DOW6</name>
              <description>Real Time Clock DOW Bit: 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCAE</name>
              <description>Real Time Clock Alarm enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCADAY</name>
          <description>Real Time Clock Alarm Day</description>
          <addressOffset>27</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>DAY0</name>
              <description>Real Time Clock Day Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY1</name>
              <description>Real Time Clock Day Bit: 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY2</name>
              <description>Real Time Clock Day Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY3</name>
              <description>Real Time Clock Day Bit: 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY4</name>
              <description>Real Time Clock Day Bit: 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY5</name>
              <description>Real Time Clock Day Bit: 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DAY6</name>
              <description>Real Time Clock Day Bit: 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCAE</name>
              <description>Real Time Clock Alarm enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCTL01</name>
          <description>Real Timer Control 0/1</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCRDYIFG</name>
              <description>RTC Ready Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCAIFG</name>
              <description>RTC Alarm Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTEVIFG</name>
              <description>RTC Time Event Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOFIFG</name>
              <description>RTC 32kHz cyrstal oscillator fault interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCRDYIE</name>
              <description>RTC Ready Interrupt Enable Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCAIE</name>
              <description>RTC Alarm Interrupt Enable Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTEVIE</name>
              <description>RTC Time Event Interrupt Enable Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCOFIE</name>
              <description>RTC 32kHz cyrstal oscillator fault interrupt enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCTEV</name>
              <description>RTC Time Event 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCTEV_0</name>
                  <description>RTC Time Event: 0 (Min. changed)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEV_1</name>
                  <description>RTC Time Event: 1 (Hour changed)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEV_2</name>
                  <description>RTC Time Event: 2 (12:00 changed)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCTEV_3</name>
                  <description>RTC Time Event: 3 (00:00 changed)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCRDY</name>
              <description>RTC Ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCHOLD</name>
              <description>RTC Hold</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCBCD</name>
              <description>RTC BCD  0:Binary / 1:BCD</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCCTL23</name>
          <description>Real Timer Control 2/3</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCCAL0</name>
              <description>RTC Calibration Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCAL1</name>
              <description>RTC Calibration Bit 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCAL2</name>
              <description>RTC Calibration Bit 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCAL3</name>
              <description>RTC Calibration Bit 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCAL4</name>
              <description>RTC Calibration Bit 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCAL5</name>
              <description>RTC Calibration Bit 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCALS</name>
              <description>RTC Calibration Sign</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCCALF</name>
              <description>RTC Calibration Frequency Bit 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCCALF_0</name>
                  <description>RTC Calibration Frequency: No Output</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCALF_1</name>
                  <description>RTC Calibration Frequency: 512 Hz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCALF_2</name>
                  <description>RTC Calibration Frequency: 256 Hz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCCALF_3</name>
                  <description>RTC Calibration Frequency: 1 Hz</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCPS0CTL</name>
          <description>Real Timer Prescale Timer 0 Control</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RT0PSIFG</name>
              <description>RTC Prescale Timer 0 Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT0PSIE</name>
              <description>RTC Prescale Timer 0 Interrupt Enable Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT0IP</name>
              <description>RTC Prescale Timer 0 Interrupt Interval Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT0IP_0</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_1</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_2</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_3</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_4</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_5</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_6</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT0IP_7</name>
                  <description>RTC Prescale Timer 0 Interrupt Interval /256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCPS1CTL</name>
          <description>Real Timer Prescale Timer 1 Control</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RT1PSIFG</name>
              <description>RTC Prescale Timer 1 Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT1PSIE</name>
              <description>RTC Prescale Timer 1 Interrupt Enable Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RT1IP</name>
              <description>RTC Prescale Timer 1 Interrupt Interval Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RT1IP_0</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_1</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_2</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_3</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /16</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_4</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /32</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_5</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /64</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_6</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /128</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RT1IP_7</name>
                  <description>RTC Prescale Timer 1 Interrupt Interval /256</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCPS</name>
          <description>Real Timer Prescale Timer Control</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RTCIV</name>
          <description>Real Time Clock Interrupt Vector</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RTCYEAR</name>
          <description>Real Time Clock Year</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BIN2BCD</name>
          <description>Real Time Binary-to-BCD conversion register</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BCD2BIN</name>
          <description>Real Time BCD-to-binary conversion register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
