ardave/MSP430FR5969/msp430fr5969.svd
        <register>
          <name>UCB0IFG_I2C</name>
          <description>USCI B0 Interrupt Flags Register</description>
          <alternateRegister>UCB0IFG</alternateRegister>
          <addressOffset>44</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCRXIFG0</name>
              <description>I2C Receive Interrupt Flag 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIFG0</name>
              <description>I2C Transmit Interrupt Flag 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSTTIFG</name>
              <description>I2C START Condition interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSTPIFG</name>
              <description>I2C STOP Condition interrupt Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCALIFG</name>
              <description>I2C Arbitration Lost interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCNACKIFG</name>
              <description>I2C NACK Condition interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBCNTIFG</name>
              <description>I2C Byte counter interrupt flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCCLTOIFG</name>
              <description>I2C Clock low Timeout interrupt Flag</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCRXIFG1</name>
              <description>I2C Receive Interrupt Flag 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIFG1</name>
              <description>I2C Transmit Interrupt Flag 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCRXIFG2</name>
              <description>I2C Receive Interrupt Flag 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIFG2</name>
              <description>I2C Transmit Interrupt Flag 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCRXIFG3</name>
              <description>I2C Receive Interrupt Flag 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIFG3</name>
              <description>I2C Transmit Interrupt Flag 3</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBIT9IFG</name>
              <description>I2C Bit 9 Possition Interrupt Flag 3</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0IV</name>
          <description>USCI B0 Interrupt Vector Register</description>
          <addressOffset>46</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>USCI_B0_SPI_MODE</name>
      <description>USCI_B0  SPI Mode</description>
      <baseAddress>1600</baseAddress>
      <registers>
        <register>
          <name>UCB0CTL1_SPI</name>
          <description>USCI B0 Control Register 1</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCB0CTL0_SPI</name>
          <description>USCI B0 Control Register 0</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCB0BR0_SPI</name>
          <description>USCI B0 Baud Rate 0</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCB0BR1_SPI</name>
          <description>USCI B0 Baud Rate 1</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCB0RXBUF_SPI</name>
          <description>USCI B0 Receive Buffer</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>UCB0TXBUF_SPI</name>
          <description>USCI B0 Transmit Buffer</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>UCB0IE_SPI</name>
          <description>USCI B0 Interrupt Enable Register</description>
          <addressOffset>42</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCRXIE</name>
              <description>USCI Receive Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIE</name>
              <description>USCI Transmit Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0IFG_SPI</name>
          <description>USCI B0 Interrupt Flags Register</description>
          <addressOffset>44</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCRXIFG</name>
              <description>SPI Receive Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCTXIFG</name>
              <description>SPI Transmit Interrupt Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCB0IV_SPI</name>
          <description>USCI B0 Interrupt Vector Register</description>
          <addressOffset>46</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
