ardave/MSP430FR5969/msp430fr5969.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WATCHDOG_TIMER</name>
      <description>Watchdog Timer</description>
      <baseAddress>348</baseAddress>
      <registers>
        <register>
          <name>WDTCTL</name>
          <description>Watchdog Timer Control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>WDTIS</name>
              <description>WDT - Timer Interval Select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTIS_0</name>
                  <description>WDT - Timer Interval Select: /2G</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_1</name>
                  <description>WDT - Timer Interval Select: /128M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_2</name>
                  <description>WDT - Timer Interval Select: /8192k</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_3</name>
                  <description>WDT - Timer Interval Select: /512k</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_4</name>
                  <description>WDT - Timer Interval Select: /32k</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_5</name>
                  <description>WDT - Timer Interval Select: /8192</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_6</name>
                  <description>WDT - Timer Interval Select: /512</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_7</name>
                  <description>WDT - Timer Interval Select: /64</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTCNTCL</name>
              <description>WDT - Timer Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTTMSEL</name>
              <description>WDT - Timer Mode Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTSSEL</name>
              <description>WDT - Timer Clock Source Select 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTSSEL_0</name>
                  <description>WDT - Timer Clock Source Select: SMCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_1</name>
                  <description>WDT - Timer Clock Source Select: ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_2</name>
                  <description>WDT - Timer Clock Source Select: VLO_CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_3</name>
                  <description>WDT - Timer Clock Source Select: reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTHOLD</name>
              <description>WDT - Timer hold</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CS</name>
      <description>CS  Clock System</description>
      <baseAddress>352</baseAddress>
      <registers>
        <register>
          <name>CSCTL0</name>
          <description>CS Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>CSCTL1</name>
          <description>CS Control Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DCOFSEL</name>
              <description>DCO frequency select Bit: 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOFSEL_0</name>
                  <description>DCO frequency select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_1</name>
                  <description>DCO frequency select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_2</name>
                  <description>DCO frequency select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_3</name>
                  <description>DCO frequency select: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_4</name>
                  <description>DCO frequency select: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_5</name>
                  <description>DCO frequency select: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_6</name>
                  <description>DCO frequency select: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFSEL_7</name>
                  <description>DCO frequency select: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCORSEL</name>
              <description>DCO range select.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL2</name>
          <description>CS Control Register 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SELM</name>
              <description>MCLK Source Select Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELM_0</name>
                  <description>MCLK Source Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_1</name>
                  <description>MCLK Source Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_2</name>
                  <description>MCLK Source Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_3</name>
                  <description>MCLK Source Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_4</name>
                  <description>MCLK Source Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_5</name>
                  <description>MCLK Source Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_6</name>
                  <description>MCLK Source Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELM_7</name>
                  <description>MCLK Source Select 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELS</name>
              <description>SMCLK Source Select Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELS_0</name>
                  <description>SMCLK Source Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_1</name>
                  <description>SMCLK Source Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_2</name>
                  <description>SMCLK Source Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_3</name>
                  <description>SMCLK Source Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_4</name>
                  <description>SMCLK Source Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_5</name>
                  <description>SMCLK Source Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_6</name>
                  <description>SMCLK Source Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELS_7</name>
                  <description>SMCLK Source Select 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELA</name>
              <description>ACLK Source Select Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELA_0</name>
                  <description>ACLK Source Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_1</name>
                  <description>ACLK Source Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_2</name>
                  <description>ACLK Source Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_3</name>
                  <description>ACLK Source Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_4</name>
                  <description>ACLK Source Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_5</name>
                  <description>ACLK Source Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_6</name>
                  <description>ACLK Source Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELA_7</name>
                  <description>ACLK Source Select 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL3</name>
          <description>CS Control Register 3</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DIVM</name>
              <description>MCLK Divider Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVM_0</name>
                  <description>MCLK Source Divider 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_1</name>
                  <description>MCLK Source Divider 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_2</name>
                  <description>MCLK Source Divider 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_3</name>
                  <description>MCLK Source Divider 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_4</name>
                  <description>MCLK Source Divider 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_5</name>
                  <description>MCLK Source Divider 5</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVS</name>
              <description>SMCLK Divider Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVS_0</name>
                  <description>SMCLK Source Divider 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_1</name>
                  <description>SMCLK Source Divider 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_2</name>
                  <description>SMCLK Source Divider 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_3</name>
                  <description>SMCLK Source Divider 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_4</name>
                  <description>SMCLK Source Divider 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_5</name>
                  <description>SMCLK Source Divider 5</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVA</name>
              <description>ACLK Divider Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVA_0</name>
                  <description>ACLK Source Divider 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_1</name>
                  <description>ACLK Source Divider 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_2</name>
                  <description>ACLK Source Divider 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_3</name>
                  <description>ACLK Source Divider 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_4</name>
                  <description>ACLK Source Divider 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVA_5</name>
                  <description>ACLK Source Divider 5</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
