ardave/MSP430FR5969/msp430fr5969.svd
        <register>
          <name>CSCTL4</name>
          <description>CS Control Register 4</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LFXTOFF</name>
              <description>Low Frequency Oscillator (LFXT) disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMCLKOFF</name>
              <description>SMCLK Off</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLOOFF</name>
              <description>VLO Off</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFXTBYPASS</name>
              <description>LFXT bypass mode : 0: internal 1:sourced from external pin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LFXTDRIVE</name>
              <description>LFXT Drive Level mode Bit 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LFXTDRIVE_0</name>
                  <description>LFXT Drive Level mode: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXTDRIVE_1</name>
                  <description>LFXT Drive Level mode: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXTDRIVE_2</name>
                  <description>LFXT Drive Level mode: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LFXTDRIVE_3</name>
                  <description>LFXT Drive Level mode: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXTOFF</name>
              <description>High Frequency Oscillator disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFFREQ</name>
              <description>HFXT frequency selection Bit 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFFREQ_0</name>
                  <description>HFXT frequency selection: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFFREQ_1</name>
                  <description>HFXT frequency selection: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFFREQ_2</name>
                  <description>HFXT frequency selection: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFFREQ_3</name>
                  <description>HFXT frequency selection: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HFXTBYPASS</name>
              <description>HFXT bypass mode : 0: internal 1:sourced from external pin</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFXTDRIVE</name>
              <description>HFXT Drive Level mode Bit 0</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HFXTDRIVE_0</name>
                  <description>HFXT Drive Level mode: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTDRIVE_1</name>
                  <description>HFXT Drive Level mode: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTDRIVE_2</name>
                  <description>HFXT Drive Level mode: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HFXTDRIVE_3</name>
                  <description>HFXT Drive Level mode: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL5</name>
          <description>CS Control Register 5</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LFXTOFFG</name>
              <description>LFXT Low Frequency Oscillator Fault Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HFXTOFFG</name>
              <description>HFXT High Frequency Oscillator Fault Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENSTFCNT1</name>
              <description>Enable start counter for XT1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENSTFCNT2</name>
              <description>Enable start counter for XT2</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL6</name>
          <description>CS Control Register 6</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ACLKREQEN</name>
              <description>ACLK Clock Request Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCLKREQEN</name>
              <description>MCLK Clock Request Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMCLKREQEN</name>
              <description>SMCLK Clock Request Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODCLKREQEN</name>
              <description>MODOSC Clock Request Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
