ardave/MSP430FR5969/msp430fr5969.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS</name>
      <description>SYS  System Module</description>
      <baseAddress>384</baseAddress>
      <registers>
        <register>
          <name>SYSCTL</name>
          <description>System control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSRIVECT</name>
              <description>SYS - RAM based interrupt vectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSPMMPE</name>
              <description>SYS - PMM access protect</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBSLIND</name>
              <description>SYS - TCK/RST indication detected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSJTAGPIN</name>
              <description>SYS - Dedicated JTAG pins enabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBC</name>
          <description>JTAG mailbox control</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>JMBIN0FG</name>
              <description>SYS - Incoming JTAG Mailbox 0 Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBIN1FG</name>
              <description>SYS - Incoming JTAG Mailbox 1 Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBOUT0FG</name>
              <description>SYS - Outgoing JTAG Mailbox 0 Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBOUT1FG</name>
              <description>SYS - Outgoing JTAG Mailbox 1 Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBMODE</name>
              <description>SYS - JMB 16/32 Bit Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBCLR0OFF</name>
              <description>SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBCLR1OFF</name>
              <description>SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBI0</name>
          <description>JTAG mailbox input 0</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSJMBI1</name>
          <description>JTAG mailbox input 1</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSJMBO0</name>
          <description>JTAG mailbox output 0</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSJMBO1</name>
          <description>JTAG mailbox output 1</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSUNIV</name>
          <description>User NMI vector generator</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSSNIV</name>
          <description>System NMI vector generator</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSRSTIV</name>
          <description>Reset vector generator</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SHARED_REFERENCE</name>
      <description>Shared Reference</description>
      <baseAddress>432</baseAddress>
      <registers>
        <register>
          <name>REFCTL0</name>
          <description>REF Shared Reference control register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>REFON</name>
              <description>REF Reference On</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFOUT</name>
              <description>REF Reference output Buffer On</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFTCOFF</name>
              <description>REF Temp.Sensor off</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFVSEL</name>
              <description>REF Reference Voltage Level Select Bit:0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>REFVSEL_0</name>
                  <description>REF Reference Voltage Level Select 1.2V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_1</name>
                  <description>REF Reference Voltage Level Select 2.0V</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_2</name>
                  <description>REF Reference Voltage Level Select 2.5V</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>REFVSEL_3</name>
                  <description>REF Reference Voltage Level Select 2.5V</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFGENOT</name>
              <description>REF Reference generator one-time trigger</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBGOT</name>
              <description>REF Bandgap and bandgap buffer one-time trigger</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFGENACT</name>
              <description>REF Reference generator active</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBGACT</name>
              <description>REF Reference bandgap active</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFGENBUSY</name>
              <description>REF Reference generator busy</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BGMODE</name>
              <description>REF Bandgap mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFGENRDY</name>
              <description>REF Reference generator ready</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBGRDY</name>
              <description>REF Reference bandgap ready</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
