ardave/MSP430FR5969/msp430fr5969.svd
        <register>
          <name>TB0CCTL5</name>
          <description>Timer0_B7 Capture/Compare Control 5</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>Capture/compare interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COV</name>
              <description>Capture/compare overflow flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT</name>
              <description>PWM Output signal if output mode 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCI</name>
              <description>Capture input signal (read)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIE</name>
              <description>Capture/compare interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>Output mode 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <description>PWM output mode: 0 - output only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <description>PWM output mode: 1 - set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <description>PWM output mode: 2 - PWM toggle/reset</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <description>PWM output mode: 3 - PWM set/reset</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <description>PWM output mode: 4 - toggle</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <description>PWM output mode: 5 - Reset</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <description>PWM output mode: 6 - PWM toggle/set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <description>PWM output mode: 7 - PWM reset/set</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>Capture mode: 1 /Compare mode : 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLLD</name>
              <description>Compare latch load source 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <description>Compare latch load sourec : 0 - immediate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <description>Compare latch load sourec : 1 - TBR counts to 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <description>Compare latch load sourec : 2 - up/down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>Capture sychronize</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIS</name>
              <description>Capture input select 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIS_0</name>
                  <description>Capture input select: 0 - CCIxA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_1</name>
                  <description>Capture input select: 1 - CCIxB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_2</name>
                  <description>Capture input select: 2 - GND</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_3</name>
                  <description>Capture input select: 3 - Vcc</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Capture mode 1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <description>Capture mode: 0 - disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <description>Capture mode: 1 - pos. edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <description>Capture mode: 1 - neg. edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <description>Capture mode: 1 - both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TB0CCTL6</name>
          <description>Timer0_B7 Capture/Compare Control 6</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>Capture/compare interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COV</name>
              <description>Capture/compare overflow flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT</name>
              <description>PWM Output signal if output mode 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCI</name>
              <description>Capture input signal (read)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIE</name>
              <description>Capture/compare interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>Output mode 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <description>PWM output mode: 0 - output only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <description>PWM output mode: 1 - set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <description>PWM output mode: 2 - PWM toggle/reset</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <description>PWM output mode: 3 - PWM set/reset</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <description>PWM output mode: 4 - toggle</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <description>PWM output mode: 5 - Reset</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <description>PWM output mode: 6 - PWM toggle/set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <description>PWM output mode: 7 - PWM reset/set</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>Capture mode: 1 /Compare mode : 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLLD</name>
              <description>Compare latch load source 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <description>Compare latch load sourec : 0 - immediate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <description>Compare latch load sourec : 1 - TBR counts to 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <description>Compare latch load sourec : 2 - up/down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>Capture sychronize</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIS</name>
              <description>Capture input select 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIS_0</name>
                  <description>Capture input select: 0 - CCIxA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_1</name>
                  <description>Capture input select: 1 - CCIxB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_2</name>
                  <description>Capture input select: 2 - GND</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_3</name>
                  <description>Capture input select: 3 - Vcc</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Capture mode 1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <description>Capture mode: 0 - disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <description>Capture mode: 1 - pos. edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <description>Capture mode: 1 - neg. edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <description>Capture mode: 1 - both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TB0R</name>
          <description>Timer0_B7</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0CCR0</name>
          <description>Timer0_B7 Capture/Compare 0</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0CCR1</name>
          <description>Timer0_B7 Capture/Compare 1</description>
          <addressOffset>20</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0CCR2</name>
          <description>Timer0_B7 Capture/Compare 2</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0CCR3</name>
          <description>Timer0_B7 Capture/Compare 3</description>
          <addressOffset>24</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0CCR4</name>
          <description>Timer0_B7 Capture/Compare 4</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0CCR5</name>
          <description>Timer0_B7 Capture/Compare 5</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0CCR6</name>
          <description>Timer0_B7 Capture/Compare 6</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TB0EX0</name>
          <description>Timer0_B7 Expansion Register 0</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>TBIDEX</name>
              <description>Timer0_B7 Input divider expansion Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TBIDEX_0</name>
                  <description>Timer0_B7 Input divider expansion : /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_1</name>
                  <description>Timer0_B7 Input divider expansion : /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_2</name>
                  <description>Timer0_B7 Input divider expansion : /3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_3</name>
                  <description>Timer0_B7 Input divider expansion : /4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_4</name>
                  <description>Timer0_B7 Input divider expansion : /5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_5</name>
                  <description>Timer0_B7 Input divider expansion : /6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_6</name>
                  <description>Timer0_B7 Input divider expansion : /7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TBIDEX_7</name>
                  <description>Timer0_B7 Input divider expansion : /8</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TB0IV</name>
          <description>Timer0_B7 Interrupt Vector Word</description>
          <addressOffset>46</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
