ardave/MSP430FR5969/msp430fr5969.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPY_32</name>
      <description>MPY 32  Multiplier  32 Bit Mode</description>
      <baseAddress>1232</baseAddress>
      <registers>
        <register>
          <name>MPY32L</name>
          <description>32-bit operand 1 - multiply - low word</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPY32H</name>
          <description>32-bit operand 1 - multiply - high word</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPYS32L</name>
          <description>32-bit operand 1 - signed multiply - low word</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MPYS32H</name>
          <description>32-bit operand 1 - signed multiply - high word</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MAC32L</name>
          <description>32-bit operand 1 - multiply accumulate - low word</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MAC32H</name>
          <description>32-bit operand 1 - multiply accumulate - high word</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MACS32L</name>
          <description>32-bit operand 1 - signed multiply accumulate - low word</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>MACS32H</name>
          <description>32-bit operand 1 - signed multiply accumulate - high word</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>OP2L</name>
          <description>32-bit operand 2 - low word</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>OP2H</name>
          <description>32-bit operand 2 - high word</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES0</name>
          <description>32x32-bit result 0 - least significant word</description>
          <addressOffset>20</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES1</name>
          <description>32x32-bit result 1</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES2</name>
          <description>32x32-bit result 2</description>
          <addressOffset>24</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RES3</name>
          <description>32x32-bit result 3 - most significant word</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA</description>
      <baseAddress>1280</baseAddress>
      <registers>
        <register>
          <name>DMACTL0</name>
          <description>DMA Module Control 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DMA0TSEL</name>
              <description>DMA channel 0 transfer select bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA0TSEL_0</name>
                  <description>DMA channel 0 transfer select 0:  DMA_REQ (sw)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_1</name>
                  <description>DMA channel 0 transfer select 1:</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_2</name>
                  <description>DMA channel 0 transfer select 2:</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_3</name>
                  <description>DMA channel 0 transfer select 3:</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_4</name>
                  <description>DMA channel 0 transfer select 4:</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_5</name>
                  <description>DMA channel 0 transfer select 5:</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_6</name>
                  <description>DMA channel 0 transfer select 6:</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_7</name>
                  <description>DMA channel 0 transfer select 7:</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_8</name>
                  <description>DMA channel 0 transfer select 8:</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_9</name>
                  <description>DMA channel 0 transfer select 9:</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_10</name>
                  <description>DMA channel 0 transfer select 10:</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_11</name>
                  <description>DMA channel 0 transfer select 11:</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_12</name>
                  <description>DMA channel 0 transfer select 12:</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_13</name>
                  <description>DMA channel 0 transfer select 13:</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_14</name>
                  <description>DMA channel 0 transfer select 14:</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_15</name>
                  <description>DMA channel 0 transfer select 15:</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_16</name>
                  <description>DMA channel 0 transfer select 16:</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_17</name>
                  <description>DMA channel 0 transfer select 17:</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_18</name>
                  <description>DMA channel 0 transfer select 18:</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_19</name>
                  <description>DMA channel 0 transfer select 19:</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_20</name>
                  <description>DMA channel 0 transfer select 20:</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_21</name>
                  <description>DMA channel 0 transfer select 21:</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_22</name>
                  <description>DMA channel 0 transfer select 22:</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_23</name>
                  <description>DMA channel 0 transfer select 23:</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_24</name>
                  <description>DMA channel 0 transfer select 24:</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_25</name>
                  <description>DMA channel 0 transfer select 25:</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_26</name>
                  <description>DMA channel 0 transfer select 26:</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_27</name>
                  <description>DMA channel 0 transfer select 27:</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_28</name>
                  <description>DMA channel 0 transfer select 28:</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_29</name>
                  <description>DMA channel 0 transfer select 29:</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_30</name>
                  <description>DMA channel 0 transfer select 30: previous DMA channel DMA2IFG</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_31</name>
                  <description>DMA channel 0 transfer select 31: ext. Trigger (DMAE0)</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA1TSEL</name>
              <description>DMA channel 1 transfer select bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA1TSEL_0</name>
                  <description>DMA channel 1 transfer select 0:  DMA_REQ (sw)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_1</name>
                  <description>DMA channel 1 transfer select 1:</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_2</name>
                  <description>DMA channel 1 transfer select 2:</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_3</name>
                  <description>DMA channel 1 transfer select 3:</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_4</name>
                  <description>DMA channel 1 transfer select 4:</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_5</name>
                  <description>DMA channel 1 transfer select 5:</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_6</name>
                  <description>DMA channel 1 transfer select 6:</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_7</name>
                  <description>DMA channel 1 transfer select 7:</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_8</name>
                  <description>DMA channel 1 transfer select 8:</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_9</name>
                  <description>DMA channel 1 transfer select 9:</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_10</name>
                  <description>DMA channel 1 transfer select 10:</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_11</name>
                  <description>DMA channel 1 transfer select 11:</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_12</name>
                  <description>DMA channel 1 transfer select 12:</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_13</name>
                  <description>DMA channel 1 transfer select 13:</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_14</name>
                  <description>DMA channel 1 transfer select 14:</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_15</name>
                  <description>DMA channel 1 transfer select 15:</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_16</name>
                  <description>DMA channel 1 transfer select 16:</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_17</name>
                  <description>DMA channel 1 transfer select 17:</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_18</name>
                  <description>DMA channel 1 transfer select 18:</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_19</name>
                  <description>DMA channel 1 transfer select 19:</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_20</name>
                  <description>DMA channel 1 transfer select 20:</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_21</name>
                  <description>DMA channel 1 transfer select 21:</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_22</name>
                  <description>DMA channel 1 transfer select 22:</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_23</name>
                  <description>DMA channel 1 transfer select 23:</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_24</name>
                  <description>DMA channel 1 transfer select 24:</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_25</name>
                  <description>DMA channel 1 transfer select 25:</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_26</name>
                  <description>DMA channel 1 transfer select 26:</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_27</name>
                  <description>DMA channel 1 transfer select 27:</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_28</name>
                  <description>DMA channel 1 transfer select 28:</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_29</name>
                  <description>DMA channel 1 transfer select 29:</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_30</name>
                  <description>DMA channel 1 transfer select 30: previous DMA channel DMA0IFG</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_31</name>
                  <description>DMA channel 1 transfer select 31: ext. Trigger (DMAE0)</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
