ardave/MSP430FR5969/msp430fr5969.svd
        <register>
          <name>DMA1CTL</name>
          <description>DMA Channel 1 Control</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DMAREQ</name>
              <description>Initiate DMA transfer with DMATSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAABORT</name>
              <description>DMA transfer aborted by NMI</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIE</name>
              <description>DMA interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIFG</name>
              <description>DMA interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMALEVEL</name>
              <description>DMA level sensitive trigger select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASRCBYTE</name>
              <description>DMA source byte</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMADSTBYTE</name>
              <description>DMA destination byte</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASRCINCR</name>
              <description>DMA source increment bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASRCINCR_0</name>
                  <description>DMA source increment 0: source address unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_1</name>
                  <description>DMA source increment 1: source address unchanged</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_2</name>
                  <description>DMA source increment 2: source address decremented</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_3</name>
                  <description>DMA source increment 3: source address incremented</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTINCR</name>
              <description>DMA destination increment bit 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADSTINCR_0</name>
                  <description>DMA destination increment 0: destination address unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_1</name>
                  <description>DMA destination increment 1: destination address unchanged</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_2</name>
                  <description>DMA destination increment 2: destination address decremented</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_3</name>
                  <description>DMA destination increment 3: destination address incremented</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADT</name>
              <description>DMA transfer mode bit 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADT_0</name>
                  <description>DMA transfer mode 0: Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_1</name>
                  <description>DMA transfer mode 1: Block transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_2</name>
                  <description>DMA transfer mode 2: Burst-Block transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_3</name>
                  <description>DMA transfer mode 3: Burst-Block transfer</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_4</name>
                  <description>DMA transfer mode 4: Repeated Single transfer</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_5</name>
                  <description>DMA transfer mode 5: Repeated Block transfer</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_6</name>
                  <description>DMA transfer mode 6: Repeated Burst-Block transfer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_7</name>
                  <description>DMA transfer mode 7: Repeated Burst-Block transfer</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA1SZ</name>
          <description>DMA Channel 1 Transfer Size</description>
          <addressOffset>42</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>DMA2CTL</name>
          <description>DMA Channel 2 Control</description>
          <addressOffset>48</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DMAREQ</name>
              <description>Initiate DMA transfer with DMATSEL</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAABORT</name>
              <description>DMA transfer aborted by NMI</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIE</name>
              <description>DMA interrupt enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAIFG</name>
              <description>DMA interrupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAEN</name>
              <description>DMA enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMALEVEL</name>
              <description>DMA level sensitive trigger select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASRCBYTE</name>
              <description>DMA source byte</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMADSTBYTE</name>
              <description>DMA destination byte</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMASRCINCR</name>
              <description>DMA source increment bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMASRCINCR_0</name>
                  <description>DMA source increment 0: source address unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_1</name>
                  <description>DMA source increment 1: source address unchanged</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_2</name>
                  <description>DMA source increment 2: source address decremented</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMASRCINCR_3</name>
                  <description>DMA source increment 3: source address incremented</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADSTINCR</name>
              <description>DMA destination increment bit 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADSTINCR_0</name>
                  <description>DMA destination increment 0: destination address unchanged</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_1</name>
                  <description>DMA destination increment 1: destination address unchanged</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_2</name>
                  <description>DMA destination increment 2: destination address decremented</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADSTINCR_3</name>
                  <description>DMA destination increment 3: destination address incremented</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMADT</name>
              <description>DMA transfer mode bit 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMADT_0</name>
                  <description>DMA transfer mode 0: Single transfer</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_1</name>
                  <description>DMA transfer mode 1: Block transfer</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_2</name>
                  <description>DMA transfer mode 2: Burst-Block transfer</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_3</name>
                  <description>DMA transfer mode 3: Burst-Block transfer</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_4</name>
                  <description>DMA transfer mode 4: Repeated Single transfer</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_5</name>
                  <description>DMA transfer mode 5: Repeated Block transfer</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_6</name>
                  <description>DMA transfer mode 6: Repeated Burst-Block transfer</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMADT_7</name>
                  <description>DMA transfer mode 7: Repeated Burst-Block transfer</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMA2SZ</name>
          <description>DMA Channel 2 Transfer Size</description>
          <addressOffset>58</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>DMA0SA</name>
          <description>DMA Channel 0 Source Address</description>
          <addressOffset>18</addressOffset>
          <size>32</size>
          <resetMask>4294967295</resetMask>
        </register>
        <register>
          <name>DMA0DA</name>
          <description>DMA Channel 0 Destination Address</description>
          <addressOffset>22</addressOffset>
          <size>32</size>
          <resetMask>4294967295</resetMask>
        </register>
        <register>
          <name>DMA1SA</name>
          <description>DMA Channel 1 Source Address</description>
          <addressOffset>34</addressOffset>
          <size>32</size>
          <resetMask>4294967295</resetMask>
        </register>
        <register>
          <name>DMA1DA</name>
          <description>DMA Channel 1 Destination Address</description>
          <addressOffset>38</addressOffset>
          <size>32</size>
          <resetMask>4294967295</resetMask>
        </register>
        <register>
          <name>DMA2SA</name>
          <description>DMA Channel 2 Source Address</description>
          <addressOffset>50</addressOffset>
          <size>32</size>
          <resetMask>4294967295</resetMask>
        </register>
        <register>
          <name>DMA2DA</name>
          <description>DMA Channel 2 Destination Address</description>
          <addressOffset>54</addressOffset>
          <size>32</size>
          <resetMask>4294967295</resetMask>
        </register>
