ardave/MSP430FR5969/msp430fr5969.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>MPU</name>
      <description>MPU</description>
      <baseAddress>1440</baseAddress>
      <registers>
        <register>
          <name>MPUCTL0</name>
          <description>MPU Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MPUENA</name>
              <description>MPU Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPULOCK</name>
              <description>MPU Lock</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGIE</name>
              <description>MPU Enable NMI on Segment violation</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPUCTL1</name>
          <description>MPU Control Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MPUSEG1IFG</name>
              <description>MPU Main Memory Segment 1 violation interupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG2IFG</name>
              <description>MPU Main Memory Segment 2 violation interupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG3IFG</name>
              <description>MPU Main Memory Segment 3 violation interupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGIIFG</name>
              <description>MPU Info Memory Segment violation interupt flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGIPIFG</name>
              <description>MPU IP Memory Segment violation interupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPUSEGB2</name>
          <description>MPU Segmentation Border 2 Register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>MPUSEGB20</name>
              <description>MPU Segment Border 2 Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB21</name>
              <description>MPU Segment Border 2 Bit: 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB22</name>
              <description>MPU Segment Border 2 Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB23</name>
              <description>MPU Segment Border 2 Bit: 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB24</name>
              <description>MPU Segment Border 2 Bit: 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB25</name>
              <description>MPU Segment Border 2 Bit: 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB26</name>
              <description>MPU Segment Border 2 Bit: 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB27</name>
              <description>MPU Segment Border 2 Bit: 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB28</name>
              <description>MPU Segment Border 2 Bit: 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB29</name>
              <description>MPU Segment Border 2 Bit: 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB210</name>
              <description>MPU Segment Border 2 Bit: 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB211</name>
              <description>MPU Segment Border 2 Bit: 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB212</name>
              <description>MPU Segment Border 2 Bit: 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB213</name>
              <description>MPU Segment Border 2 Bit: 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB214</name>
              <description>MPU Segment Border 2 Bit: 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB215</name>
              <description>MPU Segment Border 2 Bit: 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPUSEGB1</name>
          <description>MPU Segmentation Border 1 Register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>MPUSEGB10</name>
              <description>MPU Segment Border 1 Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB11</name>
              <description>MPU Segment Border 1 Bit: 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB12</name>
              <description>MPU Segment Border 1 Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB13</name>
              <description>MPU Segment Border 1 Bit: 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB14</name>
              <description>MPU Segment Border 1 Bit: 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB15</name>
              <description>MPU Segment Border 1 Bit: 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB16</name>
              <description>MPU Segment Border 1 Bit: 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB17</name>
              <description>MPU Segment Border 1 Bit: 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB18</name>
              <description>MPU Segment Border 1 Bit: 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB19</name>
              <description>MPU Segment Border 1 Bit: 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB110</name>
              <description>MPU Segment Border 1 Bit: 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB111</name>
              <description>MPU Segment Border 1 Bit: 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB112</name>
              <description>MPU Segment Border 1 Bit: 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB113</name>
              <description>MPU Segment Border 1 Bit: 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB114</name>
              <description>MPU Segment Border 1 Bit: 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGB115</name>
              <description>MPU Segment Border 1 Bit: 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPUSAM</name>
          <description>MPU Access Management Register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>MPUSEG1RE</name>
              <description>MPU Main memory Segment 1 Read enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG1WE</name>
              <description>MPU Main memory Segment 1 Write enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG1XE</name>
              <description>MPU Main memory Segment 1 Execute enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG1VS</name>
              <description>MPU Main memory Segment 1 Violation select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG2RE</name>
              <description>MPU Main memory Segment 2 Read enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG2WE</name>
              <description>MPU Main memory Segment 2 Write enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG2XE</name>
              <description>MPU Main memory Segment 2 Execute enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG2VS</name>
              <description>MPU Main memory Segment 2 Violation select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG3RE</name>
              <description>MPU Main memory Segment 3 Read enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG3WE</name>
              <description>MPU Main memory Segment 3 Write enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG3XE</name>
              <description>MPU Main memory Segment 3 Execute enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEG3VS</name>
              <description>MPU Main memory Segment 3 Violation select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGIRE</name>
              <description>MPU Info memory Segment Read enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGIWE</name>
              <description>MPU Info memory Segment Write enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGIXE</name>
              <description>MPU Info memory Segment Execute enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUSEGIVS</name>
              <description>MPU Info memory Segment Violation select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPUIPC0</name>
          <description>MPU IP Control 0 Register</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>MPUIPVS</name>
              <description>MPU MPU IP protection segment Violation Select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPENA</name>
              <description>MPU MPU IP Protection Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPLOCK</name>
              <description>MPU IP Protection Lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MPUIPSEGB2</name>
          <description>MPU IP Segment Border 2 Register</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>MPUIPSEGB20</name>
              <description>MPU IP Segment Border 2 Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB21</name>
              <description>MPU IP Segment Border 2 Bit: 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB22</name>
              <description>MPU IP Segment Border 2 Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB23</name>
              <description>MPU IP Segment Border 2 Bit: 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB24</name>
              <description>MPU IP Segment Border 2 Bit: 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB25</name>
              <description>MPU IP Segment Border 2 Bit: 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB26</name>
              <description>MPU IP Segment Border 2 Bit: 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB27</name>
              <description>MPU IP Segment Border 2 Bit: 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB28</name>
              <description>MPU IP Segment Border 2 Bit: 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB29</name>
              <description>MPU IP Segment Border 2 Bit: 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB210</name>
              <description>MPU IP Segment Border 2 Bit: 10</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB211</name>
              <description>MPU IP Segment Border 2 Bit: 11</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB212</name>
              <description>MPU IP Segment Border 2 Bit: 12</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB213</name>
              <description>MPU IP Segment Border 2 Bit: 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB214</name>
              <description>MPU IP Segment Border 2 Bit: 14</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MPUIPSEGB215</name>
              <description>MPU IP Segment Border 2 Bit: 15</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
