ardave/MSP430FR5969/msp430fr5969.svd
        <register>
          <name>ADC12MCTL12</name>
          <description>ADC12 Memory Control 12</description>
          <addressOffset>56</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC12INCH</name>
              <description>ADC12 Input Channel Select Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12INCH_0</name>
                  <description>ADC12 Input Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_1</name>
                  <description>ADC12 Input Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_2</name>
                  <description>ADC12 Input Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_3</name>
                  <description>ADC12 Input Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_4</name>
                  <description>ADC12 Input Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_5</name>
                  <description>ADC12 Input Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_6</name>
                  <description>ADC12 Input Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_7</name>
                  <description>ADC12 Input Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_8</name>
                  <description>ADC12 Input Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_9</name>
                  <description>ADC12 Input Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_10</name>
                  <description>ADC12 Input Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_11</name>
                  <description>ADC12 Input Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_12</name>
                  <description>ADC12 Input Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_13</name>
                  <description>ADC12 Input Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_14</name>
                  <description>ADC12 Input Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_15</name>
                  <description>ADC12 Input Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_16</name>
                  <description>ADC12 Input Channel 16</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_17</name>
                  <description>ADC12 Input Channel 17</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_18</name>
                  <description>ADC12 Input Channel 18</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_19</name>
                  <description>ADC12 Input Channel 19</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_20</name>
                  <description>ADC12 Input Channel 20</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_21</name>
                  <description>ADC12 Input Channel 21</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_22</name>
                  <description>ADC12 Input Channel 22</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_23</name>
                  <description>ADC12 Input Channel 23</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_24</name>
                  <description>ADC12 Input Channel 24</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_25</name>
                  <description>ADC12 Input Channel 25</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_26</name>
                  <description>ADC12 Input Channel 26</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_27</name>
                  <description>ADC12 Input Channel 27</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_28</name>
                  <description>ADC12 Input Channel 28</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_29</name>
                  <description>ADC12 Input Channel 29</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_30</name>
                  <description>ADC12 Input Channel 30</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12INCH_31</name>
                  <description>ADC12 Input Channel 31</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12EOS</name>
              <description>ADC12 End of Sequence</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12VRSEL</name>
              <description>ADC12 VR Select Bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC12VRSEL_0</name>
                  <description>ADC12 Select Reference 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_1</name>
                  <description>ADC12 Select Reference 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_2</name>
                  <description>ADC12 Select Reference 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_3</name>
                  <description>ADC12 Select Reference 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_4</name>
                  <description>ADC12 Select Reference 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_5</name>
                  <description>ADC12 Select Reference 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_6</name>
                  <description>ADC12 Select Reference 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_7</name>
                  <description>ADC12 Select Reference 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_8</name>
                  <description>ADC12 Select Reference 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_9</name>
                  <description>ADC12 Select Reference 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_10</name>
                  <description>ADC12 Select Reference 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_11</name>
                  <description>ADC12 Select Reference 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_12</name>
                  <description>ADC12 Select Reference 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_13</name>
                  <description>ADC12 Select Reference 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_14</name>
                  <description>ADC12 Select Reference 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC12VRSEL_15</name>
                  <description>ADC12 Select Reference 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12DIF</name>
              <description>ADC12 Differential mode (only for even Registers)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC12WINC</name>
              <description>ADC12 Comparator window enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
