ardave/MSP430FR5969/msp430fr5969.svd
        <register>
          <name>CEINT</name>
          <description>Comparator E Interrupt Register</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CEIFG</name>
              <description>Comp. E Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEIIFG</name>
              <description>Comp. E Interrupt Flag Inverted Polarity</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CERDYIFG</name>
              <description>Comp. E Comparator_E ready interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEIE</name>
              <description>Comp. E Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CEIIE</name>
              <description>Comp. E Interrupt Enable Inverted Polarity</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CERDYIE</name>
              <description>Comp. E Comparator_E ready interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CEIV</name>
          <description>Comparator E Interrupt Vector Word</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>AES_ACCELERATOR</name>
      <description>AES Accelerator</description>
      <baseAddress>2496</baseAddress>
      <registers>
        <register>
          <name>AESACTL0</name>
          <description>AES accelerator control register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>AESOP</name>
              <description>AES Operation Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESOP_0</name>
                  <description>AES Operation: Encrypt</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESOP_1</name>
                  <description>AES Operation: Decrypt (same Key)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESOP_2</name>
                  <description>AES Operation: Generate first round Key</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESOP_3</name>
                  <description>AES Operation: Decrypt (first round Key)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESKL</name>
              <description>AES Key length Bit: 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESKL_0</name>
                  <description>AES Key length: AES128</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESKL_1</name>
                  <description>AES Key length: AES192</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESKL_2</name>
                  <description>AES Key length: AES256</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESTRIG</name>
              <description>AES Trigger Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESCM</name>
              <description>AES Cipher mode select Bit: 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AESCM_0</name>
                  <description>AES Cipher mode select: ECB</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESCM_1</name>
                  <description>AES Cipher mode select: CBC</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESCM_2</name>
                  <description>AES Cipher mode select: OFB</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AESCM_3</name>
                  <description>AES Cipher mode select: CFB</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AESSWRST</name>
              <description>AES Software Reset</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESRDYIFG</name>
              <description>AES ready interrupt flag</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESERRFG</name>
              <description>AES Error Flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESRDYIE</name>
              <description>AES ready interrupt enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESCMEN</name>
              <description>AES DMA cipher mode enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESACTL1</name>
          <description>AES accelerator control register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>AESBLKCNT0</name>
              <description>AES Cipher Block Counter Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESBLKCNT1</name>
              <description>AES Cipher Block Counter Bit: 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESBLKCNT2</name>
              <description>AES Cipher Block Counter Bit: 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESBLKCNT3</name>
              <description>AES Cipher Block Counter Bit: 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESBLKCNT4</name>
              <description>AES Cipher Block Counter Bit: 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESBLKCNT5</name>
              <description>AES Cipher Block Counter Bit: 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESBLKCNT6</name>
              <description>AES Cipher Block Counter Bit: 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESBLKCNT7</name>
              <description>AES Cipher Block Counter Bit: 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESASTAT</name>
          <description>AES accelerator status register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>AESBUSY</name>
              <description>AES Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESKEYWR</name>
              <description>AES All 16 bytes written to AESAKEY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDINWR</name>
              <description>AES All 16 bytes written to AESADIN</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDOUTRD</name>
              <description>AES All 16 bytes read from AESADOUT</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESKEYCNT0</name>
              <description>AES Bytes written via AESAKEY Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESKEYCNT1</name>
              <description>AES Bytes written via AESAKEY Bit: 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESKEYCNT2</name>
              <description>AES Bytes written via AESAKEY Bit: 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESKEYCNT3</name>
              <description>AES Bytes written via AESAKEY Bit: 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDINCNT0</name>
              <description>AES Bytes written via AESADIN Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDINCNT1</name>
              <description>AES Bytes written via AESADIN Bit: 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDINCNT2</name>
              <description>AES Bytes written via AESADIN Bit: 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDINCNT3</name>
              <description>AES Bytes written via AESADIN Bit: 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDOUTCNT0</name>
              <description>AES Bytes read via AESADOUT Bit: 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDOUTCNT1</name>
              <description>AES Bytes read via AESADOUT Bit: 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDOUTCNT2</name>
              <description>AES Bytes read via AESADOUT Bit: 2</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AESDOUTCNT3</name>
              <description>AES Bytes read via AESADOUT Bit: 3</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AESAKEY</name>
          <description>AES accelerator key register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>AESADIN</name>
          <description>AES accelerator data in register</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>AESADOUT</name>
          <description>AES accelerator data out register</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>AESAXDIN</name>
          <description>AES accelerator XORed data in register</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>AESAXIN</name>
          <description>AES accelerator XORed data in register (no trigger)</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
